;----------------------------------------------------
; # # DO NOT REMOVE ANYTHING FROM THIS SECTION # # # 
;----------------------------------------------------

[Variables]
@IncludeConfig=#CURRENTPATH#Config\FolderConfig.inc

;----------------------------------------------------
; # # BEGIN EDITING BELOW # # # # # # # # # # # # # #
;----------------------------------------------------

NumberOfItems=10

NumberOfDividers=0

;----------------------------------------------------

ItemText1=English
ItemAction1=[!SetVariable TargetLanguageCheckmark 1][!WriteKeyValue Variables TargetLanguageCheckmark 1 "#MyVariablesLoc#"][!SetVariable TargetLanguage "en"][!WriteKeyValue Variables TargetLanguage "en" "#MyVariablesLoc#"][!UpdateMeter * "Droptop Community Apps\Apps\Translator-Bunz" "CustomApp.ini"][!Refresh "Droptop Community Apps\Apps\Translator-Bunz" "CustomApp.ini"]

ItemText2=French
ItemAction2=[!SetVariable TargetLanguageCheckmark 2][!WriteKeyValue Variables TargetLanguageCheckmark 2 "#MyVariablesLoc#"][!SetVariable TargetLanguage "fr"][!WriteKeyValue Variables TargetLanguage "fr" "#MyVariablesLoc#"][!UpdateMeter * "Droptop Community Apps\Apps\Translator-Bunz" "CustomApp.ini"][!Refresh "Droptop Community Apps\Apps\Translator-Bunz" "CustomApp.ini"]

ItemText3=German
ItemAction3=[!SetVariable TargetLanguageCheckmark 3][!WriteKeyValue Variables TargetLanguageCheckmark 3 "#MyVariablesLoc#"][!SetVariable TargetLanguage "de"][!WriteKeyValue Variables TargetLanguage "de" "#MyVariablesLoc#"][!UpdateMeter * "Droptop Community Apps\Apps\Translator-Bunz" "CustomApp.ini"][!Refresh "Droptop Community Apps\Apps\Translator-Bunz" "CustomApp.ini"]

ItemText4=Spanish
ItemAction4=[!SetVariable TargetLanguageCheckmark 4][!WriteKeyValue Variables TargetLanguageCheckmark 4 "#MyVariablesLoc#"][!SetVariable TargetLanguage "es"][!WriteKeyValue Variables TargetLanguage "es" "#MyVariablesLoc#"][!UpdateMeter * "Droptop Community Apps\Apps\Translator-Bunz" "CustomApp.ini"][!Refresh "Droptop Community Apps\Apps\Translator-Bunz" "CustomApp.ini"]

ItemText5=Italian
ItemAction5=[!SetVariable TargetLanguageCheckmark 5][!WriteKeyValue Variables TargetLanguageCheckmark 5 "#MyVariablesLoc#"][!SetVariable TargetLanguage "it"][!WriteKeyValue Variables TargetLanguage "it" "#MyVariablesLoc#"][!UpdateMeter * "Droptop Community Apps\Apps\Translator-Bunz" "CustomApp.ini"][!Refresh "Droptop Community Apps\Apps\Translator-Bunz" "CustomApp.ini"]

ItemText6=Polish
ItemAction6=[!SetVariable TargetLanguageCheckmark 6][!WriteKeyValue Variables TargetLanguageCheckmark 6 "#MyVariablesLoc#"][!SetVariable TargetLanguage "pl"][!WriteKeyValue Variables TargetLanguage "pl" "#MyVariablesLoc#"][!UpdateMeter * "Droptop Community Apps\Apps\Translator-Bunz" "CustomApp.ini"][!Refresh "Droptop Community Apps\Apps\Translator-Bunz" "CustomApp.ini"]

ItemText7=Russian
ItemAction7=[!SetVariable TargetLanguageCheckmark 7][!WriteKeyValue Variables TargetLanguageCheckmark 7 "#MyVariablesLoc#"][!SetVariable TargetLanguage "ru"][!WriteKeyValue Variables TargetLanguage "ru" "#MyVariablesLoc#"][!UpdateMeter * "Droptop Community Apps\Apps\Translator-Bunz" "CustomApp.ini"][!Refresh "Droptop Community Apps\Apps\Translator-Bunz" "CustomApp.ini"]

ItemText8=Portuguese
ItemAction8=[!SetVariable TargetLanguageCheckmark 8][!WriteKeyValue Variables TargetLanguageCheckmark 8 "#MyVariablesLoc#"][!SetVariable TargetLanguage "pt"][!WriteKeyValue Variables TargetLanguage "pt" "#MyVariablesLoc#"][!UpdateMeter * "Droptop Community Apps\Apps\Translator-Bunz" "CustomApp.ini"][!Refresh "Droptop Community Apps\Apps\Translator-Bunz" "CustomApp.ini"]

ItemText9=Japanese
ItemAction9=[!SetVariable TargetLanguageCheckmark 9][!WriteKeyValue Variables TargetLanguageCheckmark 9 "#MyVariablesLoc#"][!SetVariable TargetLanguage "ja"][!WriteKeyValue Variables TargetLanguage "ja" "#MyVariablesLoc#"][!UpdateMeter * "Droptop Community Apps\Apps\Translator-Bunz" "CustomApp.ini"][!Refresh "Droptop Community Apps\Apps\Translator-Bunz" "CustomApp.ini"]

ItemText10=Chinese
ItemAction10=[!SetVariable TargetLanguageCheckmark 10][!WriteKeyValue Variables TargetLanguageCheckmark 10 "#MyVariablesLoc#"][!SetVariable TargetLanguage "zh-CN"][!WriteKeyValue Variables TargetLanguage "zh-CN" "#MyVariablesLoc#"][!UpdateMeter * "Droptop Community Apps\Apps\Translator-Bunz" "CustomApp.ini"][!Refresh "Droptop Community Apps\Apps\Translator-Bunz" "CustomApp.ini"]

;----------------------------------------------------
; Item Names
;----------------------------------------------------

[1]

[2]

[3]

[4]

[5]

[6]

[7]

[8]

[9]

[10]

;----------------------------------------------------
; Icons
;----------------------------------------------------

[1Icon]
ImageAlpha=(#TargetLanguageCheckmark#<>1?(#DropdownItemOpacity#/3):#DropdownItemOpacity#)

[2Icon]
ImageAlpha=(#TargetLanguageCheckmark#<>2?(#DropdownItemOpacity#/3):#DropdownItemOpacity#)

[3Icon]
ImageAlpha=(#TargetLanguageCheckmark#<>3?(#DropdownItemOpacity#/3):#DropdownItemOpacity#)

[4Icon]
ImageAlpha=(#TargetLanguageCheckmark#<>4?(#DropdownItemOpacity#/3):#DropdownItemOpacity#)

[5Icon]
ImageAlpha=(#TargetLanguageCheckmark#<>5?(#DropdownItemOpacity#/3):#DropdownItemOpacity#)

[6Icon]
ImageAlpha=(#TargetLanguageCheckmark#<>6?(#DropdownItemOpacity#/3):#DropdownItemOpacity#)

[7Icon]
ImageAlpha=(#TargetLanguageCheckmark#<>7?(#DropdownItemOpacity#/3):#DropdownItemOpacity#)

[8Icon]
ImageAlpha=(#TargetLanguageCheckmark#<>8?(#DropdownItemOpacity#/3):#DropdownItemOpacity#)

[9Icon]
ImageAlpha=(#TargetLanguageCheckmark#<>9?(#DropdownItemOpacity#/3):#DropdownItemOpacity#)

[10Icon]
ImageAlpha=(#TargetLanguageCheckmark#<>10?(#DropdownItemOpacity#/3):#DropdownItemOpacity#)

